In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [3]:
%%sql
select * from test.HoursWorked

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

  emp_name   work_date  bill_hrs
0   Sachin  1990-07-01         3
1   Sachin  1990-08-01         5
2   Sehwag  1990-07-01         2
3   Sachin  1991-07-01         4

In [5]:
%%sql
select * from test.billings

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

  emp_name   bill_date  bill_rate
0   Sachin  1990-01-01         25
1   Sehwag  1989-01-01         15
2    Dhoni  1989-01-01         20
3   Sachin  1991-02-05         30

In [7]:
%%sql select hw.emp_name, work_date, bill_hrs,
    (select bill_rate from test.billings where emp_name=hw.emp_name and bill_date<=work_date order by bill_date desc limit 1) rate
    from test.HoursWorked hw

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

  emp_name   work_date  bill_hrs  rate
0   Sachin  1990-07-01         3    25
1   Sachin  1990-08-01         5    25
2   Sehwag  1990-07-01         2    15
3   Sachin  1991-07-01         4    30

In [15]:
%%sql
with bill_rates as(
select *, lead(bill_date, 1) over(partition by emp_name order by bill_date asc) as bill_end_date
from test.billings)
select hw.emp_name, sum(bill_rate * bill_hrs) total_wages
from test.HoursWorked hw join
bill_rates br on hw.emp_name = br.emp_name and hw.work_date>=bill_date and hw.work_date<ifnull(bill_end_date, date(now()))
group by 1

 * mysql+mysqlconnector://tushar:***@localhost
2 rows affected.

  emp_name total_wages
0   Sachin         320
1   Sehwag          30